app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    if @category.save
---
INSERT INTO "categories" ("name", "description", "icon", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"