app/controllers/messages_controller.rb

  def create
    @message = Message.new(message_params)

    if @message.save
---
INSERT INTO "messages" ("author", "title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["author", "Laura"], ["title", "Hello"], ["content", "I am here"], ["created_at", "2020-05-12 23:08:34.884909"], ["updated_at", "2020-05-12 23:08:34.884909"], ["user_id", 1]]

  def update
    if @message.update(message_params)
---
UPDATE "messages" SET "author" = $1, "title" = $2, "content" = $3, "updated_at" = $4 WHERE "messages"."id" = $5  [["author", "J.K. Rowling"], ["title", "Facebook"], ["content", "Emergency Notice"], ["updated_at", "2020-05-13 00:37:34.809803"], ["id", 9]]