app/controllers/messages_controller.rb

  def index
    @messages = Message.where(user_id: params[:user_id])
---
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = $1  [["user_id", 1]]