app/controllers/users_controller.rb

  def index
    @users = User.where(category_id: params[:category_id])
---
SELECT "users".* FROM "users" WHERE "users"."category_id" = $1  [["category_id", 3]]

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "time_bank", "location", "specialization", "email", "phone", "objective", "created_at", "updated_at", "category_id", "img") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"